In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("abc.csv")

In [3]:
print(df)

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [4]:
weather_data = {
        'day': ['3/1/2017','2/2/2013' , '6/8/2015'],
        'temperature' : [16 , 14 ,21],
        'windspeed' : [600 , 450 , 500],
        'event' : ['rain', 'cloudey','sunney']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey
2  6/8/2015           21        500   sunney

In [9]:
row , coloums = df.shape
row

3

In [11]:
df.head(2)

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey

In [13]:
df[2:]

        day  temperature  windspeed   event
2  6/8/2015           21        500  sunney

In [14]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [15]:
df[['event', 'day']]

     event       day
0     rain  3/1/2017
1  cloudey  2/2/2013
2   sunney  6/8/2015

In [16]:
df['temperature'].std()

3.605551275463989

In [17]:
df.describe()

       temperature   windspeed
count     3.000000    3.000000
mean     17.000000  516.666667
std       3.605551   76.376262
min      14.000000  450.000000
25%      15.000000  475.000000
50%      16.000000  500.000000
75%      18.500000  550.000000
max      21.000000  600.000000

In [19]:
df[df.temperature >= 10]

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey
2  6/8/2015           21        500   sunney

In [20]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed   event
2  6/8/2015           21        500  sunney

In [24]:
df.set_index('day' , inplace = True)

KeyError: "None of ['day'] are in the columns"

In [25]:
df

          temperature  windspeed    event
day
3/1/2017           16        600     rain
2/2/2013           14        450  cloudey
6/8/2015           21        500   sunney

In [26]:
df.loc['3/1/2017']

temperature      16
windspeed       600
event          rain
Name: 3/1/2017, dtype: object

In [28]:
df.reset_index(inplace = True)

In [29]:
df

        day  temperature  windspeed    event
0  3/1/2017           16        600     rain
1  2/2/2013           14        450  cloudey
2  6/8/2015           21        500   sunney